Repository: AMartinNo1/ama_t3_upgrade_assistant
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: de, fr, uk

source: Choose table
de: Tabelle wählen
fr: Choisir la table
uk: Виберіть таблицю

source: Synchronize Code
de: Code synchronisieren
fr: Synchroniser le code
uk: Синхронізуйте код

# synchronizeCodeStart
source: Start synchronization
de: Starte Synchronisierung
fr: Démarrer la synchronisation
uk: Розпочати синхронізацію

# synchronizeCodeStop
source: Stop synchronization
de: Stoppe Synchronisierung
fr: Arrêter la synchronisation
uk: Зупинити синхронізацію

# chooseIndents
source: Choose intends (default: %s)
de: Einrückung wählen (standard: %s)
uk: Виберіть наміри (за замовчуванням: %s)

source: Result
de: Ergebnis
fr: Résultat
uk: Результат

# knownIssues
source: Be aware of following issue: When using ::class notation and $variables the actual string is returned.
de: Aktuell gibt es folgendes, bekanntes Problem: Wenn du die ::class-Notation und $variablen verwendest, wird der eigentliche String zurückgegeben.
fr: Soyez conscient du problème suivant : Lorsque vous utilisez la notation ::class et $variables, la chaîne de caractères actuelle est retournée.
uk: Будьте в курсі наступної проблеми: Коли використовується ::class позначення і $variables фактично повертається рядок.

# knownIssues.helpMe
source: If you know how to solve it, feel free to help.
de: Wenn du weißt, wie man das Problem lösen kann, freue ich mich über Hilfe.
fr: Si vous savez comment le résoudre, n'hésitez pas à nous aider.
uk: Якщо ви знаєте, як вирішити це, не соромтеся допомогти.

# tca
source: $GLOBALS['TCA'] (Table configuration array)
fr: $GLOBALS['TCA'] (Tableau pour la configuration de la table)
uk: $GLOBALS['TCA'] (Масив конфігурації таблиці)

source: Check now!
de: Jetzt prüfen!
fr: Vérifier maintenant !
uk: Перевірити зараз!

source: Credits:
fr: Remerciements :
uk: Подяки:

# credits.prismjs.description
source: PrismJS is used for code-highlighting.
de: PrismJS wird für das Code-Highlighting genutzt.
fr: PrismJS est utilisé pour la mise en évidence du code.
uk: PrismJS використовується для виділення коду.

# credits.smoothScrolling
source: Smooth synchronized scrolling
de: Synchronisiertes Scrollen
fr: Défilement synchronisé en douceur
uk: Плавне синхронізоване прокручування

# credits.smoothScrolling.description
source: Smooth synchronized scrolling is based on Artem Kachanovskyi post on StackOverflow.
de: Synchronisiertes Scrolling basiert auf dem Post von Artem Kachanovskyi auf StackOverflow.
fr: Le défilement synchronisé en douceur est basé sur l'article d'Artem Kachanovskyi sur StackOverflow.
uk: Плавне синхронізоване прокручування основане на публікації Артема Качановського в StackOverflow.

source: Merged TCA:
de: Zusammengefügtes TCA:
fr: TCA fusionné :
uk: Об’єднаний TCA:

source: Original TCA:
fr: TCA original :
uk: Оригінальний TCA:

# originalTcaNotFound
source: Original TCA for table "%s" not found.
de: Original TCA für Tabelle "%s" nicht gefunden.
fr: TCA original introuvable pour la table "%s".
uk: Оригінальний TCA для таблиці "%s" не знайдено.
